
import math
# --------------------------------------------------------------------------------------------------------------
# print('# 1) Вводим с клавиатуры целое число X и У.')
# print(' Выводим на экран количество чисел между Х и У, которые делятся на 2 и 3')
# x = abs(int(input('Введите x- ')))
# y = abs(int(input('Введите y- ')))
# ran = range(x, y +1 )
# num = list(ran)
# print (num)
#
# spisok_1 = [] #которые делятся на 2
# spisok_2 = [] #которые делятся на 3
#
# # numbers = [1, 2, 3, 4, 5] #тренеровочный кусок
# # for i in numbers:
# #     i *= 2
# #     spisok_1.append (i)
# # print(spisok_1)
#
# for i in num:
#     if i % 2 ==0:
#         spisok_1.append (i)
# print('Из списка делятся на 2 ', spisok_1 , ' ,Колличество ', len(spisok_1))
#
# for i in num:
#     if i % 3 ==0:
#         spisok_2.append (i)
# print('Из списка делятся на 3 ', spisok_2 , ' ,Колличество ', len(spisok_2))
# --------------------------------------------------------------------------------------------------------------
# print(' 2) Вводим с клавиатуры целое число X')
# print(' Далее вводим Х целых чисел.')
# print(' Необходимо вывести на экран максимальное и второе максимальное число из введенных чисел.')
#
# x2 = abs(int(input('Введите x- ')))
# x2_2 = x2
# spisok_2_1 = []
# count = 1
# max_x1 = max_x2 = 0
# # original = 2356
# # inverted = 0
# while x2_2 != 0:
#     print('Введите число ', count , 'из', x2 ,' ', sep=" ", end="")
#     spisok_2_1.append (int(input()))
#     x2_2 -=1
#     count +=1
# print(spisok_2_1)
# # print(max_x1 , max_x2 , sep=" ")
#
# for i in spisok_2_1:
#  spisok_2_1.sort()
#  max_x1 = spisok_2_1[-1]
#  max_x2 = spisok_2_1[-2]
#  # print('Максимальное - ', spisok_2_1[-1] , 'Второе максимальное ', spisok_2_1[-2])
# print('Максимальное - ', max_x1 , 'Второе максимальное ', max_x2  , sep=" ")
# --------------------------------------------------------------------------------------------------------------
# print(' 3) Вводим с клавиатуры целое число - это зарплата.')
# print(' Нужно вывести в консоль -  Минимальное кол-во  купюр, которыми можно выдать ЗП.')
# print(' И сколько, и каких бухгалтер выдаст 25 рублевых купюр,  10 рублевых, 3 рублевых и 1 рублевых')
# cash = int(input('Введите размер ЗП '))
# cash25 = cash//25
# cash10 = (cash-cash25*25)//10
# cash3 = cash%25%10//3
# cash1 = cash%25%10%3
#
#
# print ('Купюры к выдаче')
# print(' 25 рублевых -', cash25 , 'шт.')
# print(' 10 рублевых -', cash10 , 'шт.')
# print(' 3 рублевых -', cash3 , 'шт.')
# print(' 1 рублевых -', cash1 , 'шт.')

# --------------------------------------------------------------------------------------------------------------
import collections
print(' 4) Вводим с клавиатуры многозначное число')
print(' Необходимо узнать и сказать последовательность цифр этого числа при просмотре слева направо упорядочена по возрастанию или нет.')
print(' Например 1579 - да ( 1 меньше 5, 5 меньше 7, а 7 меньше 9), 1427 - нет')

spisok_4_0 = str(input('Введите число - '))
spisok_4_1 = []
for i in range(0, len(spisok_4_0)):
    spisok_4_1.append(int(spisok_4_0[i: i + 1]))


spisok_4_2 = sorted(spisok_4_1)
#
# spisok_4_2= spisok_4_1
# spisok_4_2.sort()
# print (spisok_4_1)
# print (spisok_4_2)


if spisok_4_1 == spisok_4_2 :
    print('Список упорядочен по возрастанию')
else:
    print('Список не упорядочен')

